Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv1d (Conv1D)             (None, 40, 64)            256       
                                                                 
 batch_normalization (Batch  (None, 40, 64)            256       
 Normalization)                                                  
                                                                 
 max_pooling1d (MaxPooling1  (None, 20, 64)            0         
 D)                                                              
                                                                 
 conv1d_1 (Conv1D)           (None, 18, 128)           24704     
                                                                 
 batch_normalization_1 (Bat  (None, 18, 128)           512       
 chNormalization)                                                
                                                                 
 max_pooling1d_1 (MaxPoolin  (None, 9, 128)            0         
 g1D)                                                            
                                                                 
 flatten (Flatten)           (None, 1152)              0         
                                                                 
 dense (Dense)               (None, 128)               147584    
                                                                 
 dropout (Dropout)           (None, 128)               0         
                                                                 
 dense_1 (Dense)             (None, 64)                8256      
                                                                 
 dropout_1 (Dropout)         (None, 64)                0         
                                                                 
 dense_2 (Dense)             (None, 6)                 390       
                                                                 
=================================================================
Total params: 181958 (710.77 KB)
Trainable params: 181574 (709.27 KB)
Non-trainable params: 384 (1.50 KB)
_________________________________________________________________
